the
of
given
return
a
is
and
in
to
that
are
an
you
if
integer
array
number
where
be
each
can
it
with
for
all
n
1
two
from
or
any
there
one
0
at
not
by
such
as
string
integers
have
order
example
on
length
following
nums
-
i
same
no
x
this
has
will
only
note
may
2
minimum
0-indexed
maximum
answer
k
ith
value
after
sum
than
possible
its
some
equal
s
which
elements
between
then
must
values
true
every
first
binary
should
also
otherwise
we
more
positive
find
characters
so
into
strings
-1
left
3
list
represents
false
exactly
right
unique
other
m
element
both
them
tree
times
ie
index
empty
nodes
2d
your
int
least
contains
most
size
time
row
j
they
different
node
make
representing
numbers
sequence
their
valid
result
exists
when
multiple
letters
choose
words
b
either
7
character
column
operation
root
does
arrays
matrix
sorted
distinct
move
do
represented
write
smallest
consists
once
another
consisting
want
total
cannot
adjacent
type
non-empty
indices
three
grid
operations
implement
class
initially
format
digits
position
solution
returns
since
large
using
within
numsi
109
name
contiguous
starting
indicates
modulo
without
arr
less
range
key
new
these
4
path
5
need
but
considered
lowercase
defined
start
next
set
largest
last
table
contain
containing
before
c
target
greater
initializes
pair
even
inclusive
denotes
substring
object
generated
second
cell
remove
remaining
end
above
form
subarray
guaranteed
single
y
letter
numbered
difference
english
up
original
take
word
means
rules
consecutive
called
until
edges
function
longest
test
get
allowed
edge
use
primary
input
respectively
cells
conditions
connected
reach
pairs
id
strictly
labeled
always
cases
moves
current
non-negative
point
digit
add
change
product
subsequence
needed
design
while
points
leading
starts
score
four
however
steps
step
perform
follows
distance
space
group
used
amount
could
assume
was
answers
void
6
possibly
very
deleting
day
game
rows
appear
positions
exist
replace
formally
ai
down
way
data
graph
numsj
formed
whose
because
1s
square
case
9
answeri
top
t
many
10
who
nums1
represent
bi
num
changing
ascending
varchar
zero
notice
queries
part
would
becomes
jth
resulting
algorithm
present
person
returned
increasing
xi
task
structure
zeros
edgesi
absolute
takes
query
linked
through
ends
smaller
appears
pick
ways
0s
final
columns
been
required
substrings
d
count
head
output
r
impossible
below
undirected
itself
place
nums2
lexicographically
numslength
line
children
about
turn
non-decreasing
odd
delete
how
corresponding
process
including
yi
made
directly
8
null
previous
moving
representation
removing
direction
separated
swap
performing
subarrays
complete
good
val
common
determine
arri
none
still
split
among
cost
price
like
alice
height
let
32-bit
search
consider
according
types
divisible
information
chosen
divide
initial
along
out
z
shortest
become
accepted
too
equals
decimal
ordered
whether
people
call
groups
spaces
palindrome
already
average
except
p
highest
removed
kth
go
bottom
permutation
----------------------
boolean
satisfies
uppercase
optimally
alphabet
city
goal
placed
infinite
define
level
problem
coordinates
occurs
apply
bob
prefix
code
color
applying
shown
1-indexed
occurrence
actual
reverse
being
were
child
plane
board
leaf
area
obtained
trees
days
obtain
turns
over
convert
ab
lengths
parent
wants
l
player
queriesi
entire
playing
lower
traversal
insert
long
date
si
abc
sort
players
play
during
bitwise
combination
pass
necessarily
occurrences
those
negative
travel
derived
duplicate
water
paths
system
subsequences
special
solve
complexity
subset
repeat
minutes
select
outside
concatenation
written
u
currently
fit
beginning
added
parentheses
simultaneously
ones
forward
duplicates
o
back
subtree
seconds
e
corner
know
s1
s2
together
connecting
stones
lists
bits
construct
correct
frequency
calls
twice
check
ans
interval
user
money
squares
side
lowest
10-5
keys
employee
calculate
tie
flip
relative
unit
described
visited
100
arranged
receive
based
visit
inside
needs
results
report
choosing
replacing
suppose
xor
see
build
never
follow
divided
instead
rearrange
said
larger
maximize
directions
adds
third
assigned
bottom-right
put
width
constraints
create
built-in
vertical
customer
mat
again
rectangle
text
extra
just
taken
11
he
denote
front
partition
changed
east
top-left
invalid
under
functions
meaning
greatest
adding
endi
starti
full
satisfy
describes
map
expression
standing
------------------------
rounded
names
please
nth
denoting
n-1
random
item
ids
occur
followed
found
addition
reference
upper
prices
per
located
achieve
vertically
concatenated
ui
vi
road
several
stone
filled
weight
power
location
append
1st
prime
coordinate
stop
repeated
buy
ansi
students
student
assign
certain
bit
nums0
modify
employees
run
mentioned
division
signed
bst
leftmost
method
immediately
fewer
exceed
colors
horizontal
places
backward
numsk
round
arrlength
nums1i
closest
continue
passed
arrj
rotate
done
sentence
trailing
pointsi
costs
intervals
arr1
state
divisor
wordsi
specifically
maximized
clockwise
land
horizontally
units
longer
removes
middle
subtract
scores
increase
calculated
specific
wall
reaches
floor
items
west
box
might
diagonal
stops
inserted
minimized
users
store
deleted
x-axis
consist
keep
assuming
include
col
circular
reads
rest
merge
destination
vertices
friends
cover
available
increment
123
wins
additional
finish
sums
ri
similarly
depth
south
north
differ
network
condition
v
replaced
foreign
counted
gets
ending
permutations
pattern
palindromic
runs
walk
sequences
directed
match
moment
minute
-----------------------
share
fits
his
non-overlapping
belongs
well
friend
cities
minimize
begin
constructed
matches
dictionary
2nd
h
sign
rotation
12
due
building
jump
win
x1
room
customers
nearest
circle
higher
salary
off
o1
inserts
rightmost
file
sell
examples
seats
concatenating
25
properties
around
asked
onto
robot
repeating
rule
encoded
modified
4-directionally
much
now
transform
inputs
fn
3rd
version
events
solutions
wait
red
leave
having
f
our
company
lefti
arr0
randomly
-------------------
event
neighbors
rotated
alternating
probability
pointer
rooted
leaves
15
singly
pay
w
rectangular
supports
seat
remain
additionally
performed
ordering
subtrees
stack
white
blue
limit
queue
2n
speed
stream
program
going
pile
transactions
decide
base
belong
traveling
covered
products
similar
shows
constant
flips
denoted
meets
piece
played
1000
x-y
dollars
profit
x2
righti
-x
userid
13
continuous
plus
holds
had
earliest
boxes
identical
work
leetcode
zeroes
later
combinations
high
created
placing
center
what
pricei
arbitrary
etc
non-zero
hold
word2
word1
winner
orders
applied
colored
car
bidirectional
making
stock
piles
26
subsets
a2
read
lets
suffix
indicating
rearranging
included
image
rank
meet
pieces
num1
satisfied
num2
makes
operator
decided
0th
tasked
gridij
house
reversed
timei
decrease
rounds
tasks
candies
open
uses
degrees
low
capacity
update
coins
instance
triplets
help
serialization
started
support
completely
nums2i
reorder
weights
mark
swapping
heights
course
language
block
double
top-right
intersection
arithmetic
insertion
cycles
segment
year
request
stay
requirements
pricesi
push
nothing
bool
anywhere
latest
lexicographical
she
category
vertex
associated
divides
fromi
toi
thus
excluding
say
andor
composed
own
changes
versa
vice
numsi1
y1
abcde
arrive
subsequent
free
happens
intervalsi
parts
recall
houses
message
received
90
forms
a1
slength
remains
cycle
manner
chessboard
in-place
memory
modifying
inserting
sorting
running
come
radius
stored
answerlength
queriesj
indexed
beautiful
indicate
balanced
sets
rectangles
comes
rearranged
team
label
break
card
island
collect
obstacle
mapping
evaluate
axis-aligned
bottom-left
231
brackets
expressions
arr2
across
roads
swaps
five
overlapping
sides
evaluates
pop
implementation
distribute
regardless
overlap
taking
series
enum
accepts
source
fully
contained
country
alices
nums2j
ranges
formatted
runtime
picked
rotating
4th
stonesi
hour
hours
notes
enter
hand
ensure
street
generate
amongst
1th
intersect
20
whole
broken
perfect
maximal
separate
triangle
vowel
labels
manager
decreasing
frequent
period
explanation
querieslength
missing
absx
shape
23
earlier
choice
existing
black
doing
small
sql
mean
completed
sold
c1
cards
repeatedly
half
balls
courses
bank
able
factor
give
g
multiply
figure
descending
previously
future
record
concatenate
segments
logs
strs
preorder
21
321
parallel
copy
deletion
pushes
far
judge
factors
costi
finally
garden
encoding
descendant
cut
boundary
draw
olog
surrounded
provided
equivalent
checks
goes
productid
particular
themselves
increases
non-increasing
reconstruct
food
testcases
shares
ancestor
hi
earn
selected
cols
nor
bag
satisfying
disjoint
waiting
y2
arrarrlength
li
lose
30
movement
descendants
worker
met
workers
converting
appended
symbol
converted
tasksi
closed
job
hhmm
individually
abcd
frog
jumps
reached
divisors
chooses
moved
cardinal
collection
definition
kind
toward
counts
forming
nodeval
lie
real
roots
sequentially
lines
content
print
best
public
sentences
vowels
finished
parents
ci
sit
rating
teams
endpoints
exam
01
centered
neighboring
addint
equally
ball
absi
wikipedia
obstacles
evenly
grouped
opposite
q
did
generates
multiplication
allow
101
others
requests
fixed
reachable
eat
22
loses
transaction
happy
passes
towards
increments
drop
works
answer1
answer0
candy
secret
significant
exact
trying
stores
alternate
timestamp
trip
visits
weighted
us
world
operators
compute
consecutively
away
arrival
linear
preceding
arrk
unknown
answerj
hello
gain
buildings
office
occupied
walls
positioned
here
counterclockwise
splitting
removal
social
persons
automatically
wi
property
server
sent
indirectly
wrong
16
enough
neither
address
pivot
50
phone
lead
access
replacement
continuously
continues
department
employeeid
simple
independent
threshold
coin
shapes
partitions
reset
shift
pairsi
calculation
website
sale
limited
shorter
video
plant
outgoing
allocate
procedure
anagram
interpreted
perm
permi
median
1234
sitting
treat
00
c2
r1
attack
partitioned
fall
marked
numeric
diagonally
computed
huge
doesnt
computer
unless
-------------------------
differs
underlined
fill
evaluation
blocks
produce
fourth
tokens
her
-3
instructions
variable
multiplied
printed
chunk
locations
merged
matching
methods
arrives
threads
leaving
returning
painted
idi
built
maps
log
positioni
conversion
shop
unable
nice
facing
decoded
rooms
writing
quantity
mod
pilesi
pushint
age
flipping
palindromes
connects
vj
uj
custom
aa
constructor
falls
132
allows
necessary
perimeter
anagrams
ace
cars
straight
field
else
0000
tile
station
60
arguments
puzzle
weighti
border
104
ignored
customerid
window
restaurant
emails
accounts
email
bi-directional
nums1length
typed
keeping
expected
nested
milliseconds
executed
competition
xth
train
appending
green
named
environment
minimal
disconnected
x-coordinate
optimal
finding
media
attend
40
neighbor
mountain
downward
security
pi
via
send
passing
servers
messages
idle
guess
api
undefined
overall
symbols
cd
opening
corresponds
24-hour
unlock
alphabetically
forever
begins
parameter
diagonals
valuesi
track
cause
kinds
library
capital
alphanumeric
serialized
alphabetical
outer
criteria
planted
numsn
inclusively
14
beauty
frequencies
heighti
arrange
matter
container
percentage
duration
constraint
receives
islands
parenthesis
bags
connection
transformation
tests
periods
simplified
token
sj
yellow
causes
prerequisites
further
describe
differences
05
counting
-231
intermediate
subtraction
chunks
bus
meeting
roadsi
endpoint
updates
thread
010
paint
entries
calendar
direct
candidates
freely
determined
reduce
school
stand
yj
--
roll
rearrangement
decode
chose
successful
various
19
regular
beyond
formula
games
likely
coming
specified
logsi
gives
affect
flowers
question
root-to-leaf
disturbing
apple
y-axis
compressed
partial
simplicity
handle
unfortunately
quality
collected
varying
calling
repeats
sizes
supply
slots
month
recursively
triplet
proven
removals
infinitely
standard
trips
passengers
provide
dots
lost
tiles
solutionint
picks
robots
rowi
spend
i1th
deletions
reports
activity
includes
happen
seven
b2
account
boundaries
pathsi
respective
calculates
nums2length
searchword
legal
hamming
known
iterator
hasnext
diagram
look
face
entering
decreases
parenti
shuffled
journey
traverse
turned
section
arrows
011
trivially
spiral
n2
floors
euclidean
origin
0-9
ability
degree
instantaneously
keyboard
y-coordinate
components
component
aj
belonging
questions
135
valuei
distances
night
rob
planning
processed
elapsed
river
cross
500
domain
local
dot
status
jobs
a0
zigzag
ki
bc
jumping
erasing
uniquely
two-dimensional
whenever
infected
eight
knight
numsl
pointers
minus
getint
numi
denominations
representations
finds
shifts
paired
possibilities
try
script
leetcodecom
project
furthermore
reformat
dashes
attributes
internal
signifies
besides
refer
frogs
spell
complement
topmost
root1
root2
grow
flower
appeared
allocated
rectanglesi
statement
bad
arrangement
strange
tournament
acb
starttimei
endtimei
resulti
234
nums3
orderdate
immediate
r2
balance
considering
p1
paper
online
generator
recursive
yields
inorder
languages
knows
connections
walking
stick
ended
sk
session
f1
dont
resultant
composition
treated
connect
labelled
postorder
working
clear
happened
error
hidden
triple
summation
s3
configuration
ties
separating
variables
usual
arr2j
arr1i
splits
folder
ten
skip
dist
kilometers
marks
interested
numsnumslength
unoccupied
encode
insertint
constructs
repetition
display
partitioning
cuts
preparing
close
distancei
restrictions
unlimited
causing
booking
net
better
updated
xj
interface
records
shifting
sub-arrays
xy-plane
-2
command
execute
numerical
rolls
dice
baskets
basket
magic
equation
mathematical
participating
cant
ranks
initialized
indicesi
engage
gridrc
selling
xs
implemented
assigning
bar
main
occurring
float
decrement
fraction
remember
distribution
title
keeps
bitwise-xor
blocked
ranking
resolve
peoplei
details
wordsj
machine
nary-tree
n-ary
mapped
2s
run-length
deletes
valsi
sub
integral
diff
bobs
seq
non-space
desired
travels
stations
login
--------------------------
lands
2359
die
queens
route
acyclic
recover
restricted
filling
collide
actually
discount
passenger
picking
coli
instances
quantities
domino
wordslength
daily
ugly
colorsi
balloon
dropped
indexing
endtime
starttime
star
key-value
buffer
finishes
themself
numsleft
numsright
eating
eats
actions
anything
speedi
startpos
i-th
recent
productname
strength
wrapping
rate
17
banned
expansion
owner
paid
merging
shared
listed
throws
flight
tickets
res
flattened
flatten
judged
pref
lodashs
execution
feed
counter-clockwise
rotations
placement
experience
sometimes
a3
signal
ranging
nobody
5th
blank
occupies
mouse
boardrc
pays
arriving
customersi
buying
manhattan
0-based
alength
pairings
shuffling
eventsi
live
contact
robber
alerting
police
stashed
deepest
tell
warehouse
unused
255
addresses
ip
upper-case
numsk-1
powers
numerals
difficulty
candiesi
even-indexed
odd-indexed
aaa
105
pos
submatrix
startvalue
spread
adjacency
graphij
chess
university
teacher
salaries
numsr
counter
maintained
frequently
putint
tower
34
val1
val2
partially
half-open
implementing
arrleftright
bsts
comprise
preferred
executing
filetxt
theres
unrooted
choices
lying
offers
finishing
inputoutput
photo
cool
ring
press
aligned
requires
cpu
comprises
pyramid
covers
plots
plot
worked
bloom
stays
respect
maximizes
ancestors
levels
member
members
ratio
slices
ingredients
ever
tells
giving
show
sliding
ignoring
ignore
market
activities
001
scheduled
delivery
entirely
weightsi
effect
parser
peak
losing
fractional
touches
closing
destroyed
p2
max
iterates
guarantee
connectionsi
lock
link
fnarri
tweets
tweet
wordlist
fibonacci
existed
solving
non-leaf
evaluating
directory
device
xi1
fifth
violating
24
conflict
prerequisitesi
numcourses
pressed
staircase
climb
t1
t2
sn
lexicographic
coefficient
terms
unary
assignment
arr1length
traveled
files
folders
reminder
aba
distributed
uncommon
06
disti
liters
ride
fuel
departments
departmentid
1n
grid00
gridm
viewed
info
arrivali
timesi
subjected
calculations
1-9
swapped
0100
s0
vice-versa
in-order
correspond
him
distributions
behind
matij
tallest
yyyy-mm-dd
an-1
importance
xy
axes
2-dimensional
view
quadruplets
contents
successfully
bookint
commas
serialize
checking
denominator
gcdx
locked
assumed
obstaclesi
33
painting
tuples
len
service
restriction
fruits
captured
dies
truncate
costsi
sub-array
nesting
profiti
volume
75
checked
simply
i0
i1
lucky
retrieves
upcoming
objective
valued
attain
getrandom
singly-linked
testing
nine
2th
non-intersecting
heightsi
eventually
corners
matrixs
flipped
--------------------
positionsi
forgot
colori
itemsi
selecting
expectednumsi
assert
expectednums
assertions
expectednumslength
27
28
sheet
excel
seatsi
fx
plants
erase
few
2-d
hits
libraries
hash
context
12345
managers
managerid
clock
apples
imagine
though
abcc
xn
double-ended
deque
successive
str2
str1
k-1
cutting
col1
row2
col2
row1
well-formed
password
monotone
falling
pointing
reduces
accept
movements
meetings
1101
reaching
mini
videos
identify
obtaining
force
dead
magical
absnumsi
drives
list2
list1
region
2020
pushed
logged
mm
59
ladder
6-sided
guards
forest
graphi
widths
submatrices
depending
simulate
stacks
normal
cj
factory
crosses
drawing
bricks
indexi
vali
dimensions
bought
dollar
driving
backwards
startrow
touching
312
temperature
dates
elevation
applies
poor
dominoes
queen
occupy
1-based
matrixij
height-balanced
designed
relationship
wide
relations
prerequisite
asks
balloons
reuse
appends
hire
aforementioned
64-bit
parentsi
subgraph
vals
reading
amounti
everyone
getting
edgesj
enhances
contrast
left-to-right
precedence
avoid
deserialized
deserialize
individual
aec
movies
movie
bef
cab
eaten
whereas
action
solved
compare
reversing
rangesi
averages
visiting
chars
fair
targetsum
compress
uncolored
sales
-9
amounts
held
someday
afterward
catch
matrices
instruction
years
exceeds
structurally
bounds
marking
callback
big
regions
loss
110
32
nums1j
bracket
aab
skills
skill
completes
listinteger
income
---------------------------
chain
gap
notation
therefore
wish
routes
unlocks
sticks
buses
critical
unchanged
unsorted
gridrowcol
1001
definitely
abcba
thrown
stonevalue
a-b
parameters
departure
departs
ticketsi
layout
tested
initialize
searches
delayed
cancelled
backspace
bucket
fed
buckets
abcdefghijklmnopqrstuvwxyz
layers
cyclic
layer
gold
determines
opponents
training
energy
extension
eee
applications
sections
shot
targeti
sourcei
staying
cat
walked
safely
wheel
serving
ground
exit
designated
rented
speciali
manages
ticket
cartesian
indexes
yes
achieved
transformed
followerid
app
digitsi
enddayi
attending
startdayi
120
rightward
professional
tonight
p0
rootval
arrived
sends
master
processing
instantly
reply
newly
gone
leftj
old
rightj
efficient
ensures
3x
19216811
hexadecimal
ipv4
numsk1
numsn-1
subtracted
400
900
remainder
xl
ix
conversions
iv
numeral
multiples
roman
separation
xxxx
answerx
situation
keysi
empid
bonus
a4
1100
sleftirighti
modifies
bacd
180
internally
tails
non
lies
malware
minitial
attempts
uniformly
stopped
subject
subjects
numsr-1
numsl1
populate
struct
recently
cache
incremented
invalidate
73
cubes
surface
non-digit
coprime
throughout
circumference
drawn
linked-lists
linked-list
pairing
tracks
queryint
efficiently
majority
treesi
computing
prefers
preference
pj
limitj
init
dash
mail
v2
v1
triangles
resources
projects
reformatted
bottomright
quad-tree
sub-grid
proper
recurse
isleaf
bottomleft
terminator
topright
wiki
sub-grids
logical
topleft
sentence1
sentence2
although
jane
my
startj
spelling
keyi
metal
align
button
dial
rings
stopping
single-threaded
inverse
farmland
minimizes
numerically
installing
rods
planting
seed
non-null
extending
book
picky
stands
words2
words1
widthi
foods
alphabetic
ratings
cheese
slice
space-separated
arrangements
advances
advance
supposed
driver
pandas
simulates
enters
completing
completion
exception
--------------------------------------
package
packages
load
port
ship
attacking
enemy
quotation
quote
slash
entry
unrevealed
decki
deck
revealed
ologn
truncates
borders
rain
sea
lot
countint
mode
smash
quarter
cup
cups
glass
liquid
boxesi
cited
researcher
citations
h-index
published
papers
citationsi
researchers
durationi
effective
creating
multi-dimensional
communicate
computers
extract
locks
tweetid
endword
beginword
sessions
f0
formatting
directories
laser
join
plan
interfere
costij
xi2
face-up
week
cookies
awesome
compared
powx
exponent
uniform
ycenter
xcenter
triples
multiplicity
2x
term
evaluated
bac
arr2length
personid
exceeding
rides
namesi
b1
skipping
rests
liter
partner
intersecting
companys
tries
acceptable
contour
flat
57
citys
skyline
buyerid
orderid
2019
sellerid
worry
molecule
examine
infinity
party
selection
os
1010
0110
mixed
fulfilled
restaurants
cream
ice
restrictionsi
obeys
requirement
js
indirect
subordinates
looking
viewing
maintain
transfer
requestsi
reside
transfers
numrows
bijection
comma-separated
biginteger
pixels
flood
queues
referred
studentsj
penalty
firsti
pointslength
exclusive
108
took
mutate
index1
index2
squared
commands
housesi
summer
yet
rollsi
short
url
fruit
knights
upon
drops
guarded
eliminate
concatenates
fs
withdrawint
depositint
deposit
incoming
popular
transferred
withdraw
eval
copied
deep
converts
rounding
whitespace
groupi
case-sensitive
worst
ranksi
hands
colsum
optionally
tag
parsed
someone
025
serve
1337
mines
nums2i1
ik
mid
456
fibonacci-like
fi
printer
scoresi
agesi
ages
older
summing
presses
buttons
bulbs
solvable
roomsi
shouldnt
divisibility
ansj
filter
holding
sij
attempt
-k
transpose
0001
comma
pid
attribute
2h
decrements
realized
typei
things
kept
important
removeduplicatesnums
e2
rx
e1
union
fee
maxtime
differing
peek
sensitive
performs
reserved
flights
spans
snake
ideal
tied
systems
resolved
votes
f3
permute
installed
increased
shaped
worth
got
flowersi
spanning
dropping
removekey
convenience
innermost
protected
concept
chalkboard
transactionsi
wordlength
cba
truck
targets
2k
growing
bound
pushing
phrase
yourself
223
incomplete
bash
formats
touch
lined
outcome
freq
foo
numsb
numsc
numsa
numsd
lower-case
overlapped
rear
isfull
isempty
pizza
disconnect
cloned
finite
listnode
contaminated
findint
late
absent
eligible
attendance
award
-10
weak
strong
gridi
signs
plantsi
refill
capacities
watering
exchange
proved
pad
originally
meetingsi
frame
cherries
six
strategy
guesses
correctly
guessed
235
prints
console
printnumber
cinema
views
anti-clockwise
faces
produces
wasted
seqlength
blength
seqi
3n
codes
turning
displays
slot
pre-order
maxsum
numsindex
cook
chef
relationships
equations
equationsi
programming
aalength
routine
miles
tank
transferring
stationsi
gas
mile
heads
boomerang
treenode
crossing
landing
80
45
searchint
performance
capitalization
datetime
popped
prepending
movecost
const
sub-boxes
sudoku
stamps
boy
cipher
bug
home
hh
curr
n-queens
tripsi
drive
robbing
reordered
dag
searchstring
visible
carpetlen
idx
floating
ranked
nums0i
x0
sequential
optimize
tic-tac-toe
supported
fifo
peekpop
natively
stationary
patterns
stacked
triangular
limits
repaired
repair
brick
percent
bill
reordering
taxi
forwards
345
gridrowicoli
movesi
former
latter
situated
spreads
temperatures
summary
addnumint
wonderful
separately
principle
removeint
dominoesi
piecesi
rook
past
bishops
sure
ant
wooden
mine
replaces
history
pool
traversing
success
copies
bars
carries
carry
identified
everybody
242
4237214
274
angle
browser
angles
resets
super
primes
typing
rope
breaks
egg
unbroken
certainty
eggs
213
trim
trimmed
preserved
fn-1
cheapest
modifications
worddict
segmentation
reused
sy
sx
ty
tx
genetic
family
parents0
gardens
graphs
retrieve
ij
youre
node2
node1
batch
objects
i-1th
doubly
timej
insertstring
adhere
enclosed
pairwise
tab
groupsi
fresh
single-space
jsonparse
self-edges
210
012
afterwards
delay
lakes
sumrangeint
numarray
numarrayint
memoized
cached
likes
serializationdeserialization
reconstructed
transmitted
favorite
february
entrance
parent0
rotten
doctors
song
songs
punctuation
active
skipped
uninfected
expiration
4567012
0124567
convex
polygon
engineer
speeds
fruitsi
disappear
unsigned
answersi
startcol
ascii
page
smart
0190
ccc
bbb
leftright
maxi
lca
auxiliary
tilesi
maxsize
newnumsi
newnums
cousins
erased
f2
mass
-5
si1
decrypted
decrypt
bomb
pascals
playerid
gamesplayed
eventdate
deviceid
logging
army
relation
floating-point
activitytype
fleet
90-degree
gains
allotted
fancy
asynchronous
updateint
s1i
incorrect
recorded
iteration
sake
handling
compression
1d
shiftsi
shifta
million
population
contest
an-2
stocks
factorial
subgrid
6th
natural
02
filtered
filtering
warm
non-equal
-7
orange
inner
nums2i2
invert
optional
121241510
2510
gcd
kingdom
death
king
birth
spellchecker
pig
diameter
charged
bj
instructed
safe
calculator
x3
weakest
soldiers
strongest
nextint
rle
dividing
reporting
extended
10000
monitor
decoding
kjf
11106
aajf
grouping
submitted
images
matched
bursting
burst
duplicated
consistent
k1
k2
skilli
chemistry
post
collides
collisions
collision
permitted
strengths
18
vyz
abcdefuvwxyz
article
expressed
colj
rowj
forth
brings
excluded
ch
numsnumslength-1
studentid
categories
involving
farthest
cellsi
reject
yield
spreading
news
maxdistance
abbreviated
collecting
targety
targetx
saleid
meters
vote
collects
s1s
classes
sunday
tuesday
monday
charge
fizzbuzz
fizz
buzz
row-wise
arrow
fashion
totally
processes
odd-numbered
encodedi
independently
describing
related
ratingi
rational
raining
trap
coinsi
defines
halves
asteroid
asteroids
puts
half-closed
entered
case-insensitive
downwards
traversed
machines
distributing
operates
install
sqlcustomerid
averageamount
visitedon
analyze
therere
k-mirror
base-2
base-k
contrary
2-mirror
base-10
accountsi0
accountsi
targetlength
left-most
stamped
stamp
k-distant
subpath
arri-1
minimums
suggested
suggests
abssum
row-traversing
matlab
wanted
reshape
reshaped
handy
jfk
itineraries
airline
man
lgb
itinerary
airports
lexical
lga
4x
resr1c2height-r-1
2height1
res0n-12
resr1c-2height-r-1
resrc
nestedlist
nestediteratorlistnestedinteger
nestediterator
iteratornext
pseudocode
iteratorhasnext
fstring
wordfilterstring
wordfilter
suff
135ms
debounce
debounced
100ms
50ms
150ms
95ms
400ms
30ms
60ms
35ms
editors
backspacing
hamsters
hamster
hamstersi
4321
2143
4123
havent
zabcdefghijklmnopqrstuvwxyzabcdefghijklmnopqrstuvwxyzabcd
wraparound
turbulent
comparison
cyclically
bronze
silver
athletes
scorei
medal
athlete
groupsizesi
groupsizes1
groupsizes
energyi
opponent
initialexperience
experiencei
initialenergy
defeat
defeating
treeancestorint
getkthancestorint
treeancestor
lllll
hiiii
feeling
ll
helllllooo
ooo
helloo
oo
stretchy
heeellooo
hellooo
sentence4
is2
this1
signals
traffic
cabxbae
cxbae
ba
cabxe
bk
alicearrows
bobarrows
numarrows
shoots
ak
scoring
archery
allowedswapsi
allowedswaps
variety
001101
inspection
official
133
mousejump
catjump
ccatmmouse
subtext2
subtextk
subtext1
subtexti
numnegones
numzeros
numones
-1s
numzeroes
excellent
x22
y22
out-of-order
klmno
fghij
board00
pqrst
uvwxy
gondolas
runningcost
scenario
centennial
gondola
boardingcost
self-loops
relaxation
queuing
american
qwertyuiop
zxcvbnm
asdfghjkl
absy1
absx1
numsliri
52372
sumfirst
sumsecond
student-mentor
mentorsj
survey
mentors
mentor
studentsi
compatibility
doubled
follower
followers
551
1351315
extroverts
introvertscount
introverts
living
happiness
extrovertscount
extrovert
introvert
meanwhile
envelopes
russian
doll
envelope
envelopesi
pi1
p2n
0122n
sub-node
minrootleftval
rootrightval
sub-nodes
patience
replies
originating
patiencei
channel
resend
channels
resending
periodically
pre-defined
guessint
prioritize
warehouses
bridge
dispatched
picki
regulate
puti
19216810
20010db885a3000000008a2e03707334
192168011
queryip
2001db885a3008a2e03707334
020010db885a3000000008a2e03707334
192168100
x1x2x3x4
xilength
x1x2x3x4x5x6x7x8
20010db885a38a2e037j7334
ipv6
0124445667
4566701244
exchanges
subtractive
xc
cm
somewhere
10-13
0-3
--xxxx
personal
asterisks
mask
---xxxx
masked
quieti
quiety
richeri
quiet
logically
quietness
richer
namely
initialboxes
containedboxes
containedboxesi
statusi
jobdifficultyi
difficulties
dependent
jobdifficulty
schedule
supervisor
variance
alert
emits
2251
saves
one-hour
key-cards
keycard
keytime
key-card
2351
2352
keynamei
doors
0949
keytimei
keyname
010221
baab
queries4
330120031032041
lyb
abba
falsetrue
queries0
queries2
truefalsefalsetruetrue
queries1
queries3
abcda
palidrome
unvisited
mirrored
alone
matxy
queryi
col2i
col1i
row1i
row2i
destvalue
step-by-step
k-diff
numsii
357
numsinumslength
159
illustrated
orthogonal
deptid
teacherid
subjectid
teaches
arrrighti
arrlefti
reverses
absnumsl
sightseeing
valuesj
spots
spot
lfucache
lfu
invalidated
lfucacheint
102
divisions
patterni
3d
glue
irregular
3245
2582
a123bc34d8ef34
validly
gcdval1
runningsumi
sumnums0numsi
preserve
circles
lattice
circlesi
max15
44
max6
tracking
overlaps
module
queryrangeint
addrangeint
tracked
rangemodule
removerangeint
stonesj
majoritychecker
majoritycheckerint
treesj
bcdea
originali
derivedi
original0
preferences
preferencesi
unhappy
edgelist
edgelisti
qj
disi
arrayreduce
fninit
ultimate
fnval
reducer
explore
tenth
10th
underscore
e-mails
e-mail
incurred
offer
needsi
specialin
specialij
sqrt
u2
uk
vk
u1
profitsi
pure
capitali
ipo
soon
venture
-numsi
license
quadtree1
quadtree2
matrixes
es
aaaeeeooo
aeiou
aeoiu
aaaaaaeiiiioou
uaeio
fallout
spelled
anticlockwise
purpose
door
engraved
pressing
freedom
quest
keyword
stage
1200
trail
twos
processingtimei
act
enqueuetimei
bottommost
apex
barren
farmer
fertile
pyramidal
x-matrix
billboard
installation
welded
steel
weld
planttimei
planttime
growtime
blooms
bloomed
seeds
growtimei
blooming
growth
advantage
oriented
124789
89
37
23489
closer
end-nodes
hall
ticketing
maxrow
bookmyshowint
spectators
allocates
concert
hence
gatherint
scatterint
vary
bookmyshow
abaacc
widthjheightj
widthiheighti
width-to-height
interchangeable
cuisine
highest-rated
cuisinesi
foodratingsstring
newrating
foodratings
foodsi
highestratedstring
cuisines
changeratingstring
ratingsi
jumbo
burger
burgers
tomato
tomatoslices
totaljumbo
cheeseslices
totalsmall
statementsij
statementsii
statements
truth
za
kid
extracandies
kids
compile
slant
examroomint
examroom
sits
leaveint
cbca
caaacab
licenseplate
insensitive
abccdef
12c
selldate
precisely
specify
customerprefdeliverydate
deliveryid
hectare
four-directionally
m-1
areas
hectares
organized
4-length
forested
conveyor
shipped
belt
hero
timeseries
poisoned
ashe
attacks
teemo
timer
timeseriesi
poison
gt
quot
html
entity
apos
entities
ampersand
frasl
amp
lt
reveal
avgsi
avgs
275
k-radius
ocean
heightsrc
oceans
atlantic
pacific
flow
findsumpairs
findsumpairsint
tot
nums2index
insertions
modes
occurred
pictured
pouring
excess
100th
glasses
poured
champagne
up-left
salaryi
nonempty
primitive
decomposition
pk
outermost
rocksi
rocks
additionalrocks
capacityi
logarithmic
coursesi
lastdayi
xor-beauty
xoring
yielding
encounters
friendships
transitive
teach
friendship
friendshipsi
languagesi
ethernet
cables
acquire
matchstick
matchsticksi
matchsticks
returnedarrayi
arraymap
243801
803
243803
243
801
sessiontime
commonly
2d-array
understand
ea
computation
odd-length
evaluations
childrens
reformatting
joined
firstly
slashes
unix-style
previousparent
canonical
devices
while1
anti-theft
banki
activated
beam
beams
size1
size2
yi1
rectanglei
yi2
labelling
sixth
face-down
tokensi
gaining
strategically
unplayed
tokeni
weeks
violate
milestones
milestonesi
milestone
greed
gi
cookie
variation
zuma
endtime2
starttime2
event2
event1
starttime1
endtime1
matrixrowcol
rankp
rankq
answerrowcol
maxlocalij
maxlocal
transmission
texting
2266622
pressedkeys
hiddeni
differencesi
python
solutiondouble
randpoint
climbing
bitwise-and
min2
12335
1235
instructionsi
sumnumsi-numsj
t3
interleaving
tm
breaking
3aab
3bb
alternates
evalvars
4a
aabc
-1a14
-2aaa
evalints
-6
asterisk
well-formatted
5c
sleft
sright
kilograms
turnn
personname
turn1
travelleddistance
ln
l1
l2
l0
rod
color-position
r3g2b1
skips
hoursbefore
letting
kmh
representatives
representative
aabd
lcpij
lcp
wordjn-1
aaca
wordin-1
leadids
makename
partnerid
dailysales
dateid
partnerids
leadid
insufficient
earners
executives
earner
earns
seeing
511
512
geometric
grounded
silhouette
skylines
absolutely
termination
collectively
buildingsi
x1y1x2y2
buyer
favoritebrand
itembrand
shopping
itemid
joindate
lengthsi
querycharacters
querycharactersi
queryindices
queryindicesi
barriers
releasehydrogen
releaseoxygen
bind
bond
explicitly
barrier
hydrogen
synchronization
enforces
molecules
oxygen
chair
chairs
leavingi
targetfriend
numsnumsk
numsnumsnumsk
self-dividing
128
baseball
operationsi
separator
thousands
ab121p
cdefghijklmn
arbitrarily
abcdefghijklmnop
orderedstreamint
osinsert2
bbbbb
idkey
valuelength
ccccc
ddddd
orderedstream5
osinsert4
orderedstream
osinsert5
eeeee
aaaaa
osinsert3
osinsert1
concatentating
1110
absarri
printing
croakoffrogs
croaks
croak
type-2
type-1
classroom
cheating
fooditemi
tablenumberi
ordersicustomernameitablenumberifooditemi
customernamei
header
topping
flavors
toppingcostsi
toppingcosts
toppings
dessert
basecostsi
basecosts
flavor
alter
left-out
maxheighti
gregorian
employeesiimportance
employeesisubordinates
employeesiid
150
3-dimensional
shadow
zx
planes
projections
projection
yz
quadruplet
letter-logs
identifier
digit-logs
identifiers
space-delimited
mycalendar
aeb
aebdc
achievable
season
chips
chip
paypalishiring
convertstring
legibility
font
pahnaplsiigyir
searched
sentinel
934126
encounter
pricing
highest-ranked
global
inversions
pixel
imageij
sc
imagesrsc
sr
sandwich
sandwiches
sandwichesi
lunch
cafeteria
maxoperations
secondi
xored
pointsj
countj
repetitions
sub-sequence
fractions
less-than-or-equal-to
neccesarilly
non-coprime
lcm
snapshotarrayint
snapshotarray
array-like
setindex
getindex
snap
snapshot
snapid
lockedi
startgene
aaccggtt
8-character
investigate
aaccggta
endgene
gene
mutation
mutations
numberslength
numbersindex2
numbersindex1
121000
102001
alien
surprisingly
funcarr
mysterious
func
winston
-y
12233211
neighborhoods
neighborhood
sub-folder
folderi
sub-folders
leetcodeproblems
folderj
battleships
battleship
separates
secondword
021
targetword
firstword
nums4
nums3k
nums4l
sided
rolling
nums2n
nums21
nums1n
nums20
nums11
nums10
pseudo-palindromic
encodedecode
encodestring
httpsleetcodecomproblemsdesign-tinyurl
companion
shortening
tiny
shorturl
httptinyurlcom4e9iak
tinyurl
longurl
decodestring
basket1
basket2
minbasket1ibasket2j
patches
addpatch
demons
laid
power-ups
dungeon
princess
valiant
health
quickly
threats
fight
decides
imprisoned
orbs
rescue
countintervals
comprised
dcce
fw
fqueriesi
intersections
automate
balancei
transferint
banklong
account1
withdrawn
account2
x-values
bcosti
flying
interview
fly
acosti
arrayflat
flattening
brand
xrandom
randomindex
positivity
signedness
myatoistring
encountered
participate
commit
profitable
participates
minprofit
scheme
crimes
crime
schemes
suitsi
flush
suits
suit
poker
fulfills
rowsum
rowsumlength
colsumlength
rowsumi
colsumj
enjoy
coffee
enjoyyourcoffee
odd-valued
issue
snippet
tags
cdatacontent
wrapped
note1
unmatched
tagcontent
forbid
tagname
validator
tagnametagcontenttagname
cdatacdatacontent
unbalanced
parse
cdata
needle
haystack
mls
ml
soup
extremely
relevant
gridxiyi
minesi
arms
nums1i1
nums1i0
nums2ik
nums1ik
minnums2i0
hvhvh
providing
hhhvv
wallet
assorted
579
flength
123456579
super-palindromes
super-palindrome
minstack
retrieving
getmin
conflicts
younger
basketball
finalsum
statuses
functionality
3k
hourglass
formulas
h2o2
h2o2he3mg4
chemical
h2o23
h2o
h1o2
atom
atomic
minsizej
roomidi
hotel
sizei
absid
preferredj
fronts
backsi
backs
frontsi
endlessly
loops
2m
maxm
weirdly
inventoryi
inventory
non-repeating
by1
ay2
bx1
ay1
ax2
rectilinear
ax1
bx2
by2
00010
00001
ys
10010
solutionlistnode
argument
rand7
rand10
word0i
div
divi
tasksj
priorities
serversi
img
smoother
grayscale
surrounding
pillow
nextvisit
nextvisiti
skl
difficultyi
workerj
peoples
histogram
histograms
southwest
mirrors
receptors
receptor
ray
wordsij
differencei
differenceij
equal-length
wordsij1
fingers
switching
stages
basically
extraneous
205
000
insurance
investment
policyholder
tiv2015
2015
lat
policyholders
tiv2016
latitude
holders
2016
lon
policy
longitude
decstring
incstring
getminkey
getmaxkey
allone
irreducible
ababb
requestsj
resultj
xcentre
2d-map
ycentre
wrote
seperate
rulekey
namei
rulevalue
ballsi
carefully
abdfh
abdfg
acdfh
acefg
ra
comma-delimited
rabc
acefh
abefh
understood
concatenations
re2
rw
re1
grammar
singleton
ek
rabcd
acadbcbd
rabbc
rabcdefgh
acdfg
abefg
rexpr
2-1
columntitle
invertx
s4
0111001
reverseinvertsi
reversex
inverts
011100110110001
passingfees
passingfeesj
fees
onlogn
efabcd
abefcd
acdbef
efcdab
cdefab
cdabef
abcdef
peekingiteratoriteratorint
peekingiterator
ocurrences
bookings
lasti
bookingsi
nn
horizontalvertical
n-2
maxvalue
voter
voters
position-one
convention
f11
39916800
permuted
gifts
decorative
divider
corridor
dividers
lr
alal1ar
unreachable
devise
jobsi
suffixes
fix
0-height
prism
counti
typesi
indistinguishable
marksi
scoreij
exams
redirects
stuck
redirect
boards
mailbox
mailboxes
myhashset
hashset
containskey
addkey
lisp-like
scopes
scope
syntax
mult
expr
en
vn
10n
sentencesi
cashbacki
bcfd
abca
abacba
boxtypes
numberofunitsperboxi
trucksize
numberofboxesi
boxtypesi
5247
567
seeding
destroy
richest
wealth
accountsij
time-points
-55
-255
ns
763
k-beauty
bbcbaa
bs
aacabb
aecdb
neededapples
powerful
pushfrontint
frontmost
frontmiddleback
popfront
popback
pushbackint
pushmiddleint
popping
popmiddle
non-alphanumeric
mappingi
2932
new2
new1
329
92
93
prefix-aligned
flipsi
sized
maxbik
numsij
bij
removequeriesi
removequeries
7890
xxx
one-liner
456-7890
987-123-4567
xxx-xxx-xxxx
xxx-xxxx
rec1
rec2
against
secondplayer
firstplayer
competes
winners
compete
sublists
sublist
decompressed
uni-value
punishment
arr4
arr5
arr3
k-increasing
arri-k
refereeid
mechanism
mainly
printthird
operating
imply
comprehensiveness
printfirst
printsecond
seem
k-similar
evil
labelsi
raised
insertfront
mycirculardeque
mycirculardequeint
getfront
insertlast
deletefront
deletelast
getrear
wildcard
unordered
clone
nummatrix
nummatrixint
sumregion
sumregionint
usage
capitals
google
usa
treenoderightval
treenoderight
recovers
findelements
treenodeleft
recovered
findelementstreenode
treenodeval
treenodeleftval
vals0
valz
pk-1
vala
valsk-1
hashsub
hashs
hashvalue
vals1
1-d
rid
illegal
conductor
goods
sslength
nextlargest
baaba0
baaabb0
developed
develop
fails
versions
isbadversionversion
taller
1321
array-form
diffi
particularly
minnumsi
1j
hisher
alicebob
waters
cans
capacityb
capacitya
bobsizesj
bobsizes
alicesizesi
alicesizes
createcounter
isomorphic
preserving
ans1
ans0
indicated
bix
coordinatesi
dth
firstperson
secrets
1233344
trimmed1233344
trimmed312434
trimmedsubarraylength
33344the
3434
trimmedsubarray
-22
-20
-23
cherry
thorn
arrx
arry
helper
allowedguesses
reasonable
six-letter-long
masterguess
bruteforce
masterguessword
minjump
maxjump
sporting
clipsi
lasted
clip
clips
153
oddprintnumber
zeroevenodd
zeroevenoddint
evenprintnumber
printnumber7
010203040506
zeroprintnumber
exceptional
four-person
38
reservedseats
aisle
reservedseatsi
creator
idsi
popularity
viewcount
viewsi
creators
platform
creatorsi
allocatorint
allocateint
freed
freeint
functionalities
allocator
8-5
supplier
waste
size-4
size-8
4-2
size-2
4-3
size-3
packagesi
size-5
suppliers
boxesj
48
depths
vps
depthb
maxdeptha
vpss
deptha
encodes
rejected
600
banknotes
200
atm
prioritizes
deposits
withdrawing
banknotescount
handed
banknote
300
leftover
n3
stated
magnetic
morty
discovered
universe
c-137
invented
earth
rick
pizzas
maxdoubles
wrap
wheels
deadends
integer-sided
tastiness
sells
voyage
dish
satisfaction
discard
like-time
satisfactioni
dishes
prepared
transdate
approved
declined
subrectangle
row2col2
row1col1
newvalue
rowcol
getvalueint
updatesubrectangleint
subrectanglequeries
indexdiff
valuediff
twin
n-1-ith
twins
xiyi
xiyihere
one-letter
x--
--x
constructai
constructa
constructa0
constructb
fueli
refueling
startfuel
refuel
splicing
assumes
availabe
commons
treap
idea
comparing
faster
by-sa
eraseint
httpsenwikipediaorgwikiskiplist
kalinin
fine
skiplist
skiplists
cc
wikimedia
artyom
304050607090
red-black
comparatively
abs
capitalized
capitalize
logins
sremovablei
removablelength
removable
targetseconds
microwave
81
fatigue
generic
finger
0954
pushcost
interprets
54
startat
99
cooking
normalizes
normalized
ingredientsi
recipesi
recipe
supplies
recipes
salad
consolelogthe
tax10
taxprice
taxcallpolyfillitem
appropriate
appropriately
thisitem
taxrate
enhance
obj
callpolyfill
totalcost
functioncall
abdbec
abcabcabc
str
n1
bolded
numsi-1
fixed-width
widest
validated
stampheight
stampwidth
divisorsi
substitution
appearance
substituted
drink
bottle
numexchange
numbottles
bottles
drinking
bugs
forbidden
forbiddeni
mincurr
boustrophedon
style
-14-13
boardn
destinations
axy
bxy
ax
onetwothree
subfolders
bw
subfolder
underlying
bx
az
bz
scramble
scrambled
subgrids
vehicle
numpassengersi
discussleetcodecom
rep
subdomain
com
count-paired
implicitly
d1d2d3
9001
cpdomains
domains
d1d2
subdomains
securityi
duty
thieves
gang
cardsi
dartsi
throwing
darts
dartboard
threw
dart
0011255245
1921681312
012201
gasi
circuit
telephone
2-9
newi
mappingsi
oldi
mappings
todelete
bigger
pos2y
pos1x
pos1y
pos1v
pos2v
pos1z
pos2z
pos2x
higheri
belonged
loweri
remembers
steal
capability
refuses
robbed
steals
homes
builddictstring
magicdictionary
almost
1-day
7-day
costs0
30-day
costs1
costs2
365
planned
numcarpets
carpets
floori
3627
0316227
coincide
compactly
bitsetint
unfixint
bitset
tostring
fixint
holes
least-significant-bit
booleans
most-significant-bit
aca
abaca
ca
ababbc
baa
ac
abcbabcbcb
blacklist
blacklisted
zi1
distancetolastnodex
z2
distancetolastnodezi
z0
zi
distancetolastnodezi1
z1
zk
matrixxy
pickint
parity
10101
notepad
screen
paste
myqueue
contradiction
dj
457
333
gravity
side-view
boxs
inertia
traversing-order
circularly
aesthetically
three-letter
beneath
pleasing
stacking
positionj
roboti
repairs
factories
factoryj
crossed
obviously
permuting
greatness
numsindexi
46
maxlen
grapha
graph1
hole
cuboidsi
lengthi
widthj
heightj
cuboids
cuboid
lengthj
productsi
cashier
supermarket
getbillint
productj
amountj
paying
purchased
frequented
cashierint
groceries
subtotal
opsi
ops
mxy
janfebmaraprmayjunjulaugsepoctnovdec
revenue
sqlid
tip
tipi
ridesi
willing
requesting
queriesith
intlength
maxmove
startcolumn
fat
lowfats
recyclable
cooldown
temporary
tables
sex
444
dva
options
dv
pending
cooperated
director
directorid
actor
actorid
actordirector
stayed
fire
grass
safehouse
gcdnumsi
barcodesi
barcode
barcodes
meals
deliciousnessi
meal
deliciousness
yesterday
weather
recorddate
summaryranges
summarize
getintervals
seen
grades
abab
ccjjc
everywhere
swim
findmedian
medianfinder
xii
iiii
ii
xxvii
xx
usually
quantityi
randomizedset
dominoesj
dominoeslength
bishop
r-1
c-1
rooks
subroot
numsindex1
expressible
numsindexk
numsindex2
indexk
blocksi
recolor
ants
plank
alex
click
revealing
clickr
char
minesweeper
clickc
derivative
helpful
ful
derivatives
defanged
exempted
smooth
descent
isconnectedij
isconnected
provinces
province
maxchoosableinteger
re-use
desiredtotal
cnumselect
numselect
1e-5
succprobi
arrlen
one-bit
sweltering
boats
boat
keyspressedi
keypress
keyspressed
keypad
releasetimesi
keypresses
tester
released
releasetimes0
releasetimes
golf
rumor
trusts
secretly
trusti
town
trust
14312
1412
guessing
edits
edit
determining
vision
obstruct
angle2
posy
posx
shuffle
prevcoursej
relationsj
months
nextcoursej
sumw
075
pickindex
wlength
rth
colrow
col1row1col2row2
colorful
neededtime
neededtimei
dynamic
sizet
resizing
resize
designing
numst
sub-tree
mistake
warrior
wrr
universal
ideas
ideab
ideaa
naming
texteditor
editor
deletetextint
cursorrightint
cursorleftint
simulating
cursorposition
min10
cursor
currenttextlength
addtextstring
kith
trimi
hiring
327712
32772
arrkn
arrk1
fk
arrk0
clock-wise
src
dst
flightsi
unmodified
segmented
properly
brokenletters
malfunctioning
unmarked
interesting
distancethreshold
newflowers
caretaker
tiring
non-tiring
well-performing
pickup
pickupi
pickupdelivery
deliveryi
firstlen
secondlen
leavetimei
querytime
homework
lays
pointsrc
absc1
bth
ath
list1s
numsx
numsz
numsy
numsw
timemap
getstring
timestampprev
time-based
setstring
bce
cae
index-0
jewels
shortestpathint
graphint
edgecosti
edgecost
addedgeint
ordersi
ordersi1
backlog
ordertypei
dislikes
dislikesi
dislike
semester
relationsi
semesters
prevcoursei
nextcoursei
serializations
i-2th
sxy
single-level
currnext
multilevel
mycircularqueue
benefits
mycircularqueuek
enqueueint
dequeue
overridden
sumstring
key-val
mapsum
one-to-one
omitting
reflect
accurately
precede
guidelines
absence
omitted
secondlistj
endj
secondlist
firstlist
firstlisti
dir
subdirectory
filedirectory
looks
abstracted
nameextension
explained
dirntsubdir1nttfile1extnttsubsubdir1ntsubdir2nttsubsubdir2ntttfile2ext
subsubdir2
subsubdir1
subdir2
new-line
dirsubdir2subsubdir2file2ext
subdir1
opened
file2ext
subdirectories
picture
file1ext
highlimit
lowlimit
bakes
donuts
batchsize
batches
donut
served
till
waits
prepares
prepare
depth-first
dfs
secondary
verticalcuts
horizontalcuts
verticalcutsj
cake
horizontalcutsi
arraylast
graphv
graphu
bipartite
001112
0120
forget
discovers
discovering
11001
complementary
rainsi
anslength
floods
dry
rainslength
lake
rains
orderings
top-to-bottom
newinterval
12312
no-adjacent-flowers
flowerbed
ccenter
rcenter
multiplicand
loves
slowly
bananas
koko
bananas-per-hour
1549
49
compact
prizes
prize
prizepositions
prizepositionsi
tape
heightsj
maxheightsi1
heightsi2
heightsj-1
minheightsi
stickers
sticker
favoritecompanies
companies
favorites
favoritecompaniesi
rated
movierating
movieid
createdat
review
comprising
bills
lemonade
billsi
dfe
adc
def
entrancerow
maze
entrancecol
arraywrapper
features
early
rot
daysi
grows
applesi
trios
trio
arr1i-arr2j
playlist
boredom
playlists
listen
music
abdc
dacb
closes
incur
ba-c
afad
hyphen
ab-
-ab
hyphens
uam
questionsi
brainpoweri
decision
infection
setting
getkey
inaccessible
setkey
overwritten
un-expired
figures
traveli
responsible
garbagei
assortment
garbage
trucks
prior
n-sided
triangulate
triangulation
efficiencyi
engineers
efficiency
ababc
jug
pour
receiving
jugs
harvest
depicts
x1x2xny1y2yn
x1y1x2y2xnyn
multipliers1
multipliers0
multipliers
multipliersi
uniquecnt1
uniquecnt2
divisor1
divisor2
one-dimensional
tap
taps
watered
powersj
10-6
homerow
rowcostsr
colcosts
homepos
incurs
homecol
colcostsc
rowcosts
defensei
defense
attacki
attackj
defensej
propertiesi
directorypathfilenametxt
f2txt
f1content
f1txt
fntxtfncontent
f1txtf1content
fncontent
fntxt
rootd1d2dm
f2txtf2content
f2content
ti
maxcost
islefti
descriptions
descriptionsi
childi
browserhistoryvisitfacebookcom
clears
nullnullnullnullfacebookcomgooglecomfacebookcomnulllinkedincomgooglecomleetcodecom
browserhistoryvisitgooglecom
browserhistoryback1
backint
browserhistory
homepagelength
googlecom
forwarding
urllength
forwardint
facebookcom
linkedincom
leetcodecomgooglecomfacebookcomyoutubecom111linkedincom227
browserhistoryleetcodecom
visitstring
5000
browserhistoryvisitlinkedincom
browserhistoryvisityoutubecom
browserhistoryback2
youtubecom
browserhistoryforward1
homepage
browserhistoryback7
browserhistoryvisitvisitvisitbackbackforwardvisitforwardbackback
browserhistorystring
browserhistoryforward2
wagei
proportional
wage
qualityi
expectation
ramp
thief
himself
tour
directly-linked
thievery
6174
6141
61741
6741
0156
recentcounter
pingint
ping
3000
heaviest
minn
landed
freezes
brushing
sidelengthi
lengthwordj
lengthwordi
numsansi
carpet
lo
dinnerplates
popatstackint
dinnerplatesint
5674
1238
5678
square-free
reward2i
reward1
mice
reward1i
reward2
minsize
maxletters
maxnums2
minnums2
infrastructure
truefalse
maximizing
trues
answerkeyi
confuse
ts
answerkey
falses
11231415
nums1leftright
1112131415
1121345
nums2leftright
sumnums1
sumnums2
sumarr
hitsi
stable
erasures
erasure
peaks
nums-1
2019-01-01
2019-03-31
unitprice
saledate
3001
deci-binary
112
tilt
store2
store3
store1
digital
fn-2
bulky
heavy
redundant
priority
numsli1
numsli
numsri
expectedi
annual
defuse
code0
informer
coden-1
retail
quantitiesi
specialty
iquerieslength-1
p123m
circulate
roundsi
sectors
rounds1
marathon
sector
rounds0
ologm
alicevalues
bobvaluesi
differently
alicevaluesi
bobvalues
numsleft1
fortsk
maxij
fortsi
fort
minij
forts
heroes
numsik
numsik2
minnumsi0
maxnumsi0
xn-1
xn-2
sample
statistics
countk
sendmessage
activitydate
2019-07-27
sessionid
scrolldown
endsession
opensession
logm
logn
om
slower
fleets
catches
grid2
sub-island
sub-islands
grid1
loosely
draws
plays
outcomes
probabilities
maxpts
executes
arr0k-1
pancake
k-values
3214
sorts
careful
gender
provides
permn
getindexidx
addallinc
inc
multallm
multiplies
multall
addall
appendval
sleeps
millis
2d-plane
hasapple
hasapplei
cbad
leaf-similar
3x3
revnumsi
rev123
revx
rev120
revnumsj
purposes
expends
upright
fallen
forces
respecting
patients
hospital
patientname
diabetes
patientid
diab1
s2j
cookiesi
unfairness
worse
correcting
volatile
nature
stockprice
fixed-length
uploaded
uploadint
luprefixint
luprefix
upload
uploads
consuming
graphical
trimming
beforeitemsi
tiling
tromino
tilings
pipes
one-line
wordstxt
sunny
unix
c3
aabccc
a2bc3
arraygroupbyfn
groupby
crossword
rj
1-dimensional
shiftt
shiftz
twenty-five
km2
gdp
3000000
continent
countries
25000000
bigint
hi1
furthest
ladders
registered
username
decimals
contestid
register
bottom-up
capture
surround
startdate
averageprice
unitssold
purchasedate
enddate
printfoo
foobar
printbar
0start3
1end2
endtimestamp
functionidstart
delivering
maxweight
delivered
loaded
portscount
ports
storage
deliver
maxboxes
portsi
reduced
pathi
matrc
answerij
0144567
4567014
stockname
operationday
gainloss
floornumsi
stadium
visitdate
queue0
hj
queuej
kj
baggage
beefed
puzzlesi
cabbage
